manuales/java/referenciajava.org
#+TITLE: Manual JAVA
* Introducción
Java es un lenguage de programación orientado a objetos, se creó en 1996 y está basado en C++, es un lenguaje que se ejecuta en una máquina virtual que interpreta (la JVM, siglas de /Java Virtual Machine/) las instrucciones compiladas a bytecode (El lenguaje de la máquina virtual)
** Estructura de un programa
#+BEGIN_SRC java
  //Este fichero pertecene al paquete (carpeta) curso.java.manual (curso/java/manual)
  package curso.java.manual;

  //Esto es una importación de la clase Scanner del paquete java.io
  import java.io.Scanner;

  //Esto es una clase pública que se llama HolaMundo
  public class HolaMundo {

      /*Este es el método main (principal), 
  es un método especial que servirá comom punto de entrada a la aplicación. 
  Este método es:
  - público (puede ser accedido desde cualquier clase)
  - estático (puede ser accedido sin necesidad de crear un objeto de la clase
  -  no devuelve nada (tipo void)
  - recibe como argumentos un array (matriz) de objetos de tipo String (cadena de texto)
  ,*/
      public static void main (String [] args) {
	  //Este es un objeto de la clase Scanner que se llama scan
	  //Este objeto se inicializa con la palabra reservada new y
	  //recibe como argumento System.in (Entrada del sistema)
	  Scanner scan = new Scanner(System.in);

	  /*
	    Esto es una llamada a un método, concretamente al método print(String)
	    del atributo out de la clase System, este método imprime en la pantalla
	    (consola de texto) el texto que se le pase como parámetro y continúa
	    en la misma línea.
	    Como parámetro se le pasa la cadena de texto (String) "¿Cómo te llamas?"
	    Los valores de tipo String van siempre entre comillas dobles "
	   ,*/
	  System.out.print("¿Cómo te llamas?");

	  //Este es un objeto de la clase String (cadena de texto) que se llama nombre.
	  //Este objeto se inicializa automáticamente con el valor que devuleve
	  //el método readLine() (Método sin argumentos) del objeto scan.
	  String nombre = scan.readLine();

	  /*
	    Esto es otra llamada a un método, en este caso al println del atributo
	    out de la clase System, nótese la diferencia con la llamada anterior
	    (print -- println), ese ln añadido lo que hace es saltar de línea una
	    vez haya impreso lo que le pasemos como parámetro.

	    En este caso, como parámetro se le pasa una cadena de texto (igual que antes)
	    con el valor "Hola, " a lo que le concatenamos (sumamos) el valor de 
	    la variable nombre
	   ,*/
	  System.out.println("Hola, "+nombre);
      }
  }
#+END_SRC
