manuales/java/referenciajava.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-08 vie 15:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Manual JAVA</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Víctor Chico Rodríguez" />
</head>
<body>
<div id="content">
<h1 class="title">Manual JAVA</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf8d3631">1. Introducción</a>
<ul>
<li><a href="#orgc314704">1.1. Estructura de un programa</a></li>
</ul>
</li>
<li><a href="#orgf432e7e">2. Tipos de datos</a></li>
<li><a href="#org9d2f72f">3. Operadores</a>
<ul>
<li><a href="#org1647454">3.1. Asignación</a></li>
<li><a href="#orga80030f">3.2. Aritméticos</a>
<ul>
<li><a href="#orgbf439e5">3.2.1. Operadores unarios</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4b55635">4. Condicionales</a></li>
<li><a href="#orgd3fac00">5. Bucles</a></li>
<li><a href="#org065e579">6. Métodos</a></li>
<li><a href="#orgd3c1fb7">7. Objetos</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf8d3631" class="outline-2">
<h2 id="orgf8d3631"><span class="section-number-2">1</span> Introducción</h2>
<div class="outline-text-2" id="text-1">
<p>
Java es un lenguage de programación orientado a objetos, se creó en 1996 y está basado en C++, es un lenguaje que se ejecuta en una máquina virtual que interpreta (la JVM, siglas de <i>Java Virtual Machine</i>) las instrucciones compiladas a bytecode (El lenguaje de la máquina virtual)
</p>
</div>
<div id="outline-container-orgc314704" class="outline-3">
<h3 id="orgc314704"><span class="section-number-3">1.1</span> Estructura de un programa</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">Este fichero pertecene al paquete (carpeta) curso.java.manual (curso/java/manual)</span>
<span style="color: #268bd2; font-weight: bold;">package</span> curso.java.<span style="color: #d75fd7;">manual</span>;

<span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">Esto es una importaci&#243;n de la clase Scanner del paquete java.io</span>
<span style="color: #268bd2; font-weight: bold;">import</span> <span style="color: #d75fd7;">java</span>.<span style="color: #d75fd7;">io</span>.<span style="color: #df005f; font-weight: bold;">Scanner</span>;

<span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">Esto es una clase p&#250;blica que se llama HolaMundo</span>
<span style="color: #268bd2; font-weight: bold;">public</span> <span style="color: #268bd2; font-weight: bold;">class</span> <span style="color: #df005f; font-weight: bold;">HolaMundo</span> {

    <span style="color: #008787; background-color: #262626;">/*</span><span style="color: #008787; background-color: #262626;">Este es el m&#233;todo main (principal), </span>
<span style="color: #008787; background-color: #262626;">es un m&#233;todo especial que servir&#225; comom punto de entrada a la aplicaci&#243;n. </span>
<span style="color: #008787; background-color: #262626;">Este m&#233;todo es:</span>
<span style="color: #008787; background-color: #262626;">- p&#250;blico (puede ser accedido desde cualquier clase)</span>
<span style="color: #008787; background-color: #262626;">- est&#225;tico (puede ser accedido sin necesidad de crear un objeto de la clase</span>
<span style="color: #008787; background-color: #262626;">-  no devuelve nada (tipo void)</span>
<span style="color: #008787; background-color: #262626;">- recibe como argumentos un array (matriz) de objetos de tipo String (cadena de texto)</span>
<span style="color: #008787; background-color: #262626;">*/</span>
    <span style="color: #268bd2; font-weight: bold;">public</span> <span style="color: #268bd2; font-weight: bold;">static</span> <span style="color: #df005f; font-weight: bold;">void</span> <span style="color: #d75fd7; font-weight: bold;">main</span> (<span style="color: #df005f; font-weight: bold;">String</span> [] <span style="color: #8787d7;">args</span>) {
        <span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">Este es un objeto de la clase Scanner que se llama scan</span>
        <span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">Este objeto se inicializa con la palabra reservada new y</span>
        <span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">recibe como argumento System.in (Entrada del sistema)</span>
        <span style="color: #df005f; font-weight: bold;">Scanner</span> <span style="color: #8787d7;">scan</span> = <span style="color: #268bd2; font-weight: bold;">new</span> <span style="color: #df005f; font-weight: bold;">Scanner</span>(System.in);

        <span style="color: #008787; background-color: #262626;">/*</span>
<span style="color: #008787; background-color: #262626;">          Esto es una llamada a un m&#233;todo, concretamente al m&#233;todo print(String)</span>
<span style="color: #008787; background-color: #262626;">          del atributo out de la clase System, este m&#233;todo imprime en la pantalla</span>
<span style="color: #008787; background-color: #262626;">          (consola de texto) el texto que se le pase como par&#225;metro y contin&#250;a</span>
<span style="color: #008787; background-color: #262626;">          en la misma l&#237;nea.</span>
<span style="color: #008787; background-color: #262626;">          Como par&#225;metro se le pasa la cadena de texto (String) "&#191;C&#243;mo te llamas?"</span>
<span style="color: #008787; background-color: #262626;">          Los valores de tipo String van siempre entre comillas dobles "</span>
<span style="color: #008787; background-color: #262626;">         */</span>
        System.out.print(<span style="color: #2aa198;">"&#191;C&#243;mo te llamas?"</span>);

        <span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">Este es un objeto de la clase String (cadena de texto) que se llama nombre.</span>
        <span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">Este objeto se inicializa autom&#225;ticamente con el valor que devuleve</span>
        <span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">el m&#233;todo readLine() (M&#233;todo sin argumentos) del objeto scan.</span>
        <span style="color: #df005f; font-weight: bold;">String</span> <span style="color: #8787d7;">nombre</span> = scan.readLine();

        <span style="color: #008787; background-color: #262626;">/*</span>
<span style="color: #008787; background-color: #262626;">          Esto es otra llamada a un m&#233;todo, en este caso al println del atributo</span>
<span style="color: #008787; background-color: #262626;">          out de la clase System, n&#243;tese la diferencia con la llamada anterior</span>
<span style="color: #008787; background-color: #262626;">          (print -- println), ese ln a&#241;adido lo que hace es saltar de l&#237;nea una</span>
<span style="color: #008787; background-color: #262626;">          vez haya impreso lo que le pasemos como par&#225;metro.</span>

<span style="color: #008787; background-color: #262626;">          En este caso, como par&#225;metro se le pasa una cadena de texto (igual que antes)</span>
<span style="color: #008787; background-color: #262626;">          con el valor "Hola, " a lo que le concatenamos (sumamos) el valor de </span>
<span style="color: #008787; background-color: #262626;">          la variable nombre</span>
<span style="color: #008787; background-color: #262626;">         */</span>
        System.out.println(<span style="color: #2aa198;">"Hola, "</span>+nombre);
    }
}
</pre>
</div>
</div>
</div>
</div>
