manuales/java/referenciajava.org
* Tipos de datos
Los tipos de datos primitivos en java son los siguientes:
| tipo    | descripción                                   | clase asociada |
|---------+-----------------------------------------------+----------------|
| byte    | número entero de 8 bits (-128 a 127)          | Byte           |
| short   | número entero de 16 bits (-32768 a 32767      | Short          |
| int     | número entero de 32 bits ($-2{32}$ a $2{32}$) | Integer        |
| long    | número entero de 64 bits ($-2{64}$ a $2{64}$) | Long           |
| float   | número decimal de 32 bits                     | Float          |
| double  | número decimal de 64 bits                     | Double         |
| boolean | valor booleano o lógico (verdadero o falso)   | Boolean        |
| char    | caracter de texto (único)                     | Character      |

Los tipos de datos normalmente se usan en su forma primitiva (columna tipo) y se pueden asignar directamente, pero a veces es util usar métodos de su clase asociada.
* Operadores
** Asignación
El operador *=* se usa para asignar valores a variables:
#+BEGIN_SRC java
int a = 0;
#+END_SRC
