manuales/java/referenciajava.html
<div id="outline-container-orgf432e7e" class="outline-2">
<h2 id="orgf432e7e"><span class="section-number-2">2</span> Tipos de datos</h2>
<div class="outline-text-2" id="text-2">
<p>
Los tipos de datos primitivos en java son los siguientes:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">tipo</th>
<th scope="col" class="org-left">descripción</th>
<th scope="col" class="org-left">clase asociada</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">byte</td>
<td class="org-left">número entero de 8 bits (-128 a 127)</td>
<td class="org-left">Byte</td>
</tr>

<tr>
<td class="org-left">short</td>
<td class="org-left">número entero de 16 bits (-32768 a 32767</td>
<td class="org-left">Short</td>
</tr>

<tr>
<td class="org-left">int</td>
<td class="org-left">número entero de 32 bits (\(-2{32}\) a \(2{32}\))</td>
<td class="org-left">Integer</td>
</tr>

<tr>
<td class="org-left">long</td>
<td class="org-left">número entero de 64 bits (\(-2{64}\) a \(2{64}\))</td>
<td class="org-left">Long</td>
</tr>

<tr>
<td class="org-left">float</td>
<td class="org-left">número decimal de 32 bits</td>
<td class="org-left">Float</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">número decimal de 64 bits</td>
<td class="org-left">Double</td>
</tr>

<tr>
<td class="org-left">boolean</td>
<td class="org-left">valor booleano o lógico (verdadero o falso)</td>
<td class="org-left">Boolean</td>
</tr>

<tr>
<td class="org-left">char</td>
<td class="org-left">caracter de texto (único)</td>
<td class="org-left">Character</td>
</tr>
</tbody>
</table>

<p>
Los tipos de datos normalmente se usan en su forma primitiva (columna tipo) y se pueden asignar directamente, pero a veces es util usar métodos de su clase asociada.
</p>
</div>
</div>
<div id="outline-container-org9d2f72f" class="outline-2">
<h2 id="org9d2f72f"><span class="section-number-2">3</span> Operadores</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1647454" class="outline-3">
<h3 id="org1647454"><span class="section-number-3">3.1</span> Asignación</h3>
<div class="outline-text-3" id="text-3-1">
<p>
El operador <b>=</b> se usa para asignar valores a variables:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #df005f; font-weight: bold;">int</span> <span style="color: #8787d7;">a</span> = 0;
</pre>
</div>
</div>
</div>
