manuales/java/referenciajava.md


<a id="orga191812"></a>

# Tipos de datos

Los tipos de datos primitivos en java son los siguientes:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">tipo</th>
<th scope="col" class="org-left">descripción</th>
<th scope="col" class="org-left">clase asociada</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">byte</td>
<td class="org-left">número entero de 8 bits (-128 a 127)</td>
<td class="org-left">Byte</td>
</tr>


<tr>
<td class="org-left">short</td>
<td class="org-left">número entero de 16 bits (-32768 a 32767</td>
<td class="org-left">Short</td>
</tr>


<tr>
<td class="org-left">int</td>
<td class="org-left">número entero de 32 bits (\(-2{32}\) a \(2{32}\))</td>
<td class="org-left">Integer</td>
</tr>


<tr>
<td class="org-left">long</td>
<td class="org-left">número entero de 64 bits (\(-2{64}\) a \(2{64}\))</td>
<td class="org-left">Long</td>
</tr>


<tr>
<td class="org-left">float</td>
<td class="org-left">número decimal de 32 bits</td>
<td class="org-left">Float</td>
</tr>


<tr>
<td class="org-left">double</td>
<td class="org-left">número decimal de 64 bits</td>
<td class="org-left">Double</td>
</tr>


<tr>
<td class="org-left">boolean</td>
<td class="org-left">valor booleano o lógico (verdadero o falso)</td>
<td class="org-left">Boolean</td>
</tr>


<tr>
<td class="org-left">char</td>
<td class="org-left">caracter de texto (único)</td>
<td class="org-left">Character</td>
</tr>
</tbody>
</table>

Los tipos de datos normalmente se usan en su forma primitiva (columna tipo) y se pueden asignar directamente, pero a veces es util usar métodos de su clase asociada.


<a id="orgba0de9f"></a>

# Operadores


<a id="org5406bae"></a>

## Asignación

El operador **=** se usa para asignar valores a variables:

    int a = 0;
