manuales/java/referenciajava.html
<div id="outline-container-orga80030f" class="outline-3">
<h3 id="orga80030f"><span class="section-number-3">3.2</span> Aritméticos</h3>
<div class="outline-text-3" id="text-3-2">
<p>
En java se pueden realizar multitud de operaciones matemáticas con la misma precedencia que en la vida real, si se necesita modificar se pueden utilizar paréntesis, los operadores aritméticos son los siguientes:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operador</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>+</b></td>
<td class="org-left">Operador de suma</td>
</tr>

<tr>
<td class="org-left"><b>-</b></td>
<td class="org-left">Operador de resta</td>
</tr>

<tr>
<td class="org-left"><b>*</b></td>
<td class="org-left">Operador de multiplicación</td>
</tr>

<tr>
<td class="org-left"><b>/</b></td>
<td class="org-left">Operador de división</td>
</tr>

<tr>
<td class="org-left"><b>%</b></td>
<td class="org-left">Operador de resto de la división</td>
</tr>
</tbody>
</table>

<p>
El siguiente código es una pequeña demostración de los operadores mencionados:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2; font-weight: bold;">class</span> <span style="color: #df005f; font-weight: bold;">Aritmeticos</span> {

    <span style="color: #268bd2; font-weight: bold;">public</span> <span style="color: #268bd2; font-weight: bold;">static</span> <span style="color: #df005f; font-weight: bold;">void</span> <span style="color: #d75fd7; font-weight: bold;">main</span> (<span style="color: #df005f; font-weight: bold;">String</span>[] <span style="color: #8787d7;">args</span>) {

        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">Variable de tipo int que tendr&#225; como valor el resultado de 1 + 2</span>
        <span style="color: #df005f; font-weight: bold;">int</span> <span style="color: #8787d7;">resultado</span> = 1 + 2;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El valor de resultado es 3</span>
        System.out.println(<span style="color: #2aa198;">"1 + 2 = "</span> + resultado);
        <span style="color: #df005f; font-weight: bold;">int</span> <span style="color: #8787d7;">resultado_original</span> = resultado;

        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">Los operadores se pueden usar entre variables (num&#233;ricas) y n&#250;meros</span>
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">en este caso se resta 1 al valor de resultado primero y se asigna a</span>
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">la variable resultado despu&#233;s</span>
        resultado = resultado - 1;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El valor de resultado es 2</span>
        System.out.println(resultado_original + <span style="color: #2aa198;">" - 1 = "</span> + resultado);
        resultado_original = resultado;

        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">Multiplicamos el resultado por 2 y lo volvemos a asignar a la variable</span>
        <span style="color: #008787; background-color: #262626;">//</span><span style="color: #008787; background-color: #262626;">resultado</span>
        resultado = resultado * 2;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El valor de resultado es 4</span>
        System.out.println(resultado_original + <span style="color: #2aa198;">" * 2 = "</span> + resultado);
        resultado_original = resultado;

        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">Dividimos el resultado entre 2 y lo asignamos</span>
        resultado = resultado / 2;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El valor de resultado es 2</span>
        System.out.println(resultado_original + <span style="color: #2aa198;">" / 2 = "</span> + resultado);
        resultado_original = resultado;

        resultado = resultado + 8;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El valor de resultado es 10</span>
        System.out.println(resultado_original + <span style="color: #2aa198;">" + 8 = "</span> + resultado);
        resultado_original = resultado;

        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">Dividimos el resultado entre 7 y nos quedamos con el resto, luego lo</span>
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">asignamos</span>
        resultado = resultado % 7;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El valor de resultado es 3</span>
        System.out.println(resultado_original + <span style="color: #2aa198;">" % 7 = "</span> + resultado);
    }
}
</pre>
</div>

<p>
Como vimos anteriormente, el operador suma <b>+</b> se puede utilizar también para concatenar texto:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2; font-weight: bold;">class</span> <span style="color: #df005f; font-weight: bold;">Concatenacion</span> {
    <span style="color: #268bd2; font-weight: bold;">public</span> <span style="color: #268bd2; font-weight: bold;">static</span> <span style="color: #df005f; font-weight: bold;">void</span> <span style="color: #d75fd7; font-weight: bold;">main</span>(<span style="color: #df005f; font-weight: bold;">String</span>[] <span style="color: #8787d7;">args</span>){
        <span style="color: #df005f; font-weight: bold;">String</span> <span style="color: #8787d7;">firstString</span> = <span style="color: #2aa198;">"Esto es"</span>;
        <span style="color: #df005f; font-weight: bold;">String</span> <span style="color: #8787d7;">secondString</span> = <span style="color: #2aa198;">" una cadena de texto concatenada."</span>;
        <span style="color: #df005f; font-weight: bold;">String</span> <span style="color: #8787d7;">thirdString</span> = firstString+secondString;
        System.out.println(thirdString);
    }
}
</pre>
</div>
</div>
