manuales/java/referenciajava.org
*** Operadores unarios
En java hay un tipo de operadores aritméticos que sólo se utilizan en un operando, son los operadores unarios:
| Operador | Descripción                      |
|----------+----------------------------------|
| +        | Indica un valor positivo         |
| -        | Indica un valor negativo         |
| ++       | Incrementa en 1 el valor         |
| --       | Decrementa en 1 el valor         |
| !        | Invierte el valor de un booleano |

#+BEGIN_SRC java
  class Unarios {

      public static void main(String[] args) {

	  int resultado = +1;
	  // El resultado es 1
	  System.out.println(resultado);

	  resultado--;
	  // El resultado es 0
	  System.out.println(resultado);

	  resultado++;
	  // El resultado es 1
	  System.out.println(resultado);

	  resultado = -resultado;
	  // El resultado es -1
	  System.out.println(resultado);

	  boolean exito = false;
	  // false
	  System.out.println(exito);
	  // true
	  System.out.println(!exito);
      }
  }
#+END_SRC

Los operadores de incremento y decremento (*++* y *--*) actuan de manera diferente dependiendo de si se ponen delante o detrás del valor a modificar, si se usan de manera prefija ~++variable~ el valor se incrementa primero y la variable se usa después (ya incrementada), si se usa de manera postfija ~variable++~ se utilizará el valor de la variable sin incrementar y luego se incrementará:

#+BEGIN_SRC java
  class PrePost {
      public static void main(String[] args){
	  int i = 3;
	  i++;
	  // imprime 4
	  System.out.println(i);
	  ++i;			   
	  // imprime 5
	  System.out.println(i);
	  // imprime 6
	  System.out.println(++i);
	  // imprime 6
	  System.out.println(i++);
	  // imprime 7
	  System.out.println(i);
      }
  }
#+END_SRC
* Condicionales
* Bucles
* Métodos
* Objetos

