manuales/java/referenciajava.html
<div id="outline-container-orgbf439e5" class="outline-4">
<h4 id="orgbf439e5"><span class="section-number-4">3.2.1</span> Operadores unarios</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
En java hay un tipo de operadores aritméticos que sólo se utilizan en un operando, son los operadores unarios:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operador</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">+</td>
<td class="org-left">Indica un valor positivo</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">Indica un valor negativo</td>
</tr>

<tr>
<td class="org-left">++</td>
<td class="org-left">Incrementa en 1 el valor</td>
</tr>

<tr>
<td class="org-left">--</td>
<td class="org-left">Decrementa en 1 el valor</td>
</tr>

<tr>
<td class="org-left">!</td>
<td class="org-left">Invierte el valor de un booleano</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2; font-weight: bold;">class</span> <span style="color: #df005f; font-weight: bold;">Unarios</span> {

    <span style="color: #268bd2; font-weight: bold;">public</span> <span style="color: #268bd2; font-weight: bold;">static</span> <span style="color: #df005f; font-weight: bold;">void</span> <span style="color: #d75fd7; font-weight: bold;">main</span>(<span style="color: #df005f; font-weight: bold;">String</span>[] <span style="color: #8787d7;">args</span>) {

        <span style="color: #df005f; font-weight: bold;">int</span> <span style="color: #8787d7;">resultado</span> = +1;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El resultado es 1</span>
        System.out.println(resultado);

        resultado--;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El resultado es 0</span>
        System.out.println(resultado);

        resultado++;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El resultado es 1</span>
        System.out.println(resultado);

        resultado = -resultado;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">El resultado es -1</span>
        System.out.println(resultado);

        <span style="color: #df005f; font-weight: bold;">boolean</span> <span style="color: #8787d7;">exito</span> = <span style="color: #d75fd7;">false</span>;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">false</span>
        System.out.println(exito);
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">true</span>
        System.out.println(<span style="color: #d75fd7;">!</span>exito);
    }
}
</pre>
</div>

<p>
Los operadores de incremento y decremento (<b>++</b> y <b>--</b>) actuan de manera diferente dependiendo de si se ponen delante o detrás del valor a modificar, si se usan de manera prefija <code>++variable</code> el valor se incrementa primero y la variable se usa después (ya incrementada), si se usa de manera postfija <code>variable++</code> se utilizará el valor de la variable sin incrementar y luego se incrementará:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2; font-weight: bold;">class</span> <span style="color: #df005f; font-weight: bold;">PrePost</span> {
    <span style="color: #268bd2; font-weight: bold;">public</span> <span style="color: #268bd2; font-weight: bold;">static</span> <span style="color: #df005f; font-weight: bold;">void</span> <span style="color: #d75fd7; font-weight: bold;">main</span>(<span style="color: #df005f; font-weight: bold;">String</span>[] <span style="color: #8787d7;">args</span>){
        <span style="color: #df005f; font-weight: bold;">int</span> <span style="color: #8787d7;">i</span> = 3;
        i++;
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">imprime 4</span>
        System.out.println(i);
        ++i;                       
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">imprime 5</span>
        System.out.println(i);
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">imprime 6</span>
        System.out.println(++i);
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">imprime 6</span>
        System.out.println(i++);
        <span style="color: #008787; background-color: #262626;">// </span><span style="color: #008787; background-color: #262626;">imprime 7</span>
        System.out.println(i);
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org4b55635" class="outline-2">
<h2 id="org4b55635"><span class="section-number-2">4</span> Condicionales</h2>
</div>
<div id="outline-container-orgd3fac00" class="outline-2">
<h2 id="orgd3fac00"><span class="section-number-2">5</span> Bucles</h2>
</div>
<div id="outline-container-org065e579" class="outline-2">
<h2 id="org065e579"><span class="section-number-2">6</span> Métodos</h2>
</div>
<div id="outline-container-orgd3c1fb7" class="outline-2">
<h2 id="orgd3c1fb7"><span class="section-number-2">7</span> Objetos</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Víctor Chico Rodríguez</p>
<p class="date">Created: 2019-11-08 vie 15:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
