manuales/java/referenciajava.md


<a id="org6fd00fa"></a>

### Operadores unarios

En java hay un tipo de operadores aritméticos que sólo se utilizan en un operando, son los operadores unarios:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operador</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">+</td>
<td class="org-left">Indica un valor positivo</td>
</tr>


<tr>
<td class="org-left">-</td>
<td class="org-left">Indica un valor negativo</td>
</tr>


<tr>
<td class="org-left">++</td>
<td class="org-left">Incrementa en 1 el valor</td>
</tr>


<tr>
<td class="org-left">--</td>
<td class="org-left">Decrementa en 1 el valor</td>
</tr>


<tr>
<td class="org-left">!</td>
<td class="org-left">Invierte el valor de un booleano</td>
</tr>
</tbody>
</table>

    class Unarios {
    
        public static void main(String[] args) {
    
    	int resultado = +1;
    	// El resultado es 1
    	System.out.println(resultado);
    
    	resultado--;
    	// El resultado es 0
    	System.out.println(resultado);
    
    	resultado++;
    	// El resultado es 1
    	System.out.println(resultado);
    
    	resultado = -resultado;
    	// El resultado es -1
    	System.out.println(resultado);
    
    	boolean exito = false;
    	// false
    	System.out.println(exito);
    	// true
    	System.out.println(!exito);
        }
    }

Los operadores de incremento y decremento (**++** y **--**) actuan de manera diferente dependiendo de si se ponen delante o detrás del valor a modificar, si se usan de manera prefija `++variable` el valor se incrementa primero y la variable se usa después (ya incrementada), si se usa de manera postfija `variable++` se utilizará el valor de la variable sin incrementar y luego se incrementará:

    class PrePost {
        public static void main(String[] args){
    	int i = 3;
    	i++;
    	// imprime 4
    	System.out.println(i);
    	++i;			   
    	// imprime 5
    	System.out.println(i);
    	// imprime 6
    	System.out.println(++i);
    	// imprime 6
    	System.out.println(i++);
    	// imprime 7
    	System.out.println(i);
        }
    }


<a id="orgfc1bd01"></a>

# Condicionales


<a id="orgd1b23f2"></a>

# Bucles


<a id="org7f69c66"></a>

# Métodos


<a id="org0f5ba98"></a>

# Objetos

